In [66]:
import pandas as pd

In [67]:
dataset=pd.read_csv(r"C:\Users\wwrao\Downloads\cars.csv")
dataset.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [68]:
from sklearn.preprocessing import LabelEncoder

In [69]:
l=LabelEncoder()

In [70]:
dataset["bramd"]=l.fit_transform(dataset["brand"])
dataset

        brand  km_driven    fuel                 owner  selling_price  bramd
0      Maruti     145500  Diesel           First Owner         450000     20
1       Skoda     120000  Diesel          Second Owner         370000     27
2       Honda     140000  Petrol           Third Owner         158000     10
3     Hyundai     127000  Diesel           First Owner         225000     11
4      Maruti     120000  Petrol           First Owner         130000     20
...       ...        ...     ...                   ...            ...    ...
8123  Hyundai     110000  Petrol           First Owner         320000     11
8124  Hyundai     119000  Diesel  Fourth & Above Owner         135000     11
8125   Maruti     120000  Diesel           First Owner         382000     20
8126     Tata      25000  Diesel           First Owner         290000     28
8127     Tata      25000  Diesel           First Owner         290000     28

[8128 rows x 6 columns]

In [71]:
dataset["bramd"].value_counts()

bramd
20    2448
11    1415
19     772
28     734
29     488
10     467
9      397
4      230
26     228
30     186
3      120
27     105
23      81
13      71
31      67
6       65
21      54
7       47
2       40
17      34
14      31
22      14
8        6
16       6
12       5
15       4
0        4
5        3
18       3
1        1
24       1
25       1
Name: count, dtype: int64

In [72]:
from sklearn.preprocessing import OneHotEncoder

In [73]:
o=OneHotEncoder(drop="first")

In [74]:
a=o.fit_transform(dataset[["brand"]]).toarray()

In [75]:

dataset["brand"].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [76]:
dataset.values

array([['Maruti', 145500, 'Diesel', 'First Owner', 450000, 20],
       ['Skoda', 120000, 'Diesel', 'Second Owner', 370000, 27],
       ['Honda', 140000, 'Petrol', 'Third Owner', 158000, 10],
       ...,
       ['Maruti', 120000, 'Diesel', 'First Owner', 382000, 20],
       ['Tata', 25000, 'Diesel', 'First Owner', 290000, 28],
       ['Tata', 25000, 'Diesel', 'First Owner', 290000, 28]], dtype=object)

In [77]:
dataset=dataset.drop(columns=["brand"],axis=1)

In [79]:
b=dataset.values

In [84]:
import numpy as np
c=np.hstack([a,b])

In [86]:
len(c)

8128

In [87]:
c.shape

(8128, 36)